//
//  ProductSaveFile.swift
//  Dominos11_Starter
//
//  Created by 천지운 on 2020/05/29.
//  Copyright © 2020 Kira. All rights reserved.
//

import Foundation

struct SaveProduct {
    
    static var orderMenu: [String : [String : Any]] = [:]
    
    static let categoryTitle = ["슈퍼시드", "프리미엄", "클래식", "사이드디시", "음료", "피클소스"]
    static let product = [
        "슈퍼시드": [
            "글램핑 바비큐": [
                "사진": "글램핑 바비큐",
                "가격": 20000
            ],
            "알로하 하와이안": [
                "사진": "알로하 하와이안",
                "가격": 25000
            ],
            "우리 고구마": [
                "사진": "우리 고구마",
                "가격": 25000
            ],
            "콰트로 치즈 퐁듀": [
                "사진": "콰트로 치즈 퐁듀",
                "가격": 30000
            ]
        ],
        
        
        "프리미엄": [
            "더블크러스트 이베리코": [
                "사진": "더블크러스트 이베리코",
                "가격": 20000
            ],
            "블랙앵거스 스테이크": [
                "사진": "블랙앵거스 스테이크",
                "가격": 25000
            ],
            "블랙타이거 슈림프": [
                "사진": "블랙타이거 슈림프",
                "가격": 25000
            ],
            "와규 앤 비스테카": [
                "사진": "와규 앤 비스테카",
                "가격": 30000
            ],
            "직화 스테이크": [
                "사진": "직화 스테이크",
                "가격": 30000
            ]
        ],
        
        
        "클래식": [
            "불고기": [
                "사진": "불고기",
                "가격": 15000
            ],
            "슈퍼디럭스": [
                "사진": "슈퍼디럭스",
                "가격": 20000
            ],
            "슈퍼슈프림": [
                "사진": "슈퍼슈프림",
                "가격": 20000
            ],
            "페퍼로니": [
                "사진": "페퍼로니",
                "가격": 15000
            ],
            "포테이토": [
                "사진": "포테이토",
                "가격": 15000
            ]
        ],
        
        
        "사이드디시": [
            "딸기 슈크림": [
                "사진": "딸기 슈크림",
                "가격": 3000
            ],
            "슈퍼곡물 치킨": [
                "사진": "슈퍼곡물 치킨",
                "가격": 7000
            ],
            "애플 크러스트 디저트": [
                "사진": "애플 크러스트 디저트",
                "가격": 5000
            ],
            "치킨퐁듀 그라탕": [
                "사진": "치킨퐁듀 그라탕",
                "가격": 10000
            ],
            "퀴노아 치킨 샐러드": [
                "사진": "퀴노아 치킨 샐러드",
                "가격": 10000
            ],
            "포테이토 순살치킨": [
                "사진": "포테이토 순살치킨",
                "가격": 12000
            ]
        ],
        
        
        "피클소스": [
            "갈릭 디핑 소스": [
                "사진": "갈릭 디핑 소스",
                "가격": 500
            ],
            "스위트 칠리소스": [
                "사진": "스위트 칠리소스",
                "가격": 500
            ],
            "우리 피클 L": [
                "사진": "우리 피클 L",
                "가격": 1000
            ],
            "우리 피클 M": [
                "사진": "우리 피클 M",
                "가격": 500
            ],
            "핫소스": [
                "사진": "핫소스",
                "가격": 500
            ]
        ],
        
        
        "음료": [
            "미닛메이드 스파클링 청포도": [
                "사진": "미닛메이드 스파클링 청포도",
                "가격": 2000
            ],
            "스프라이트": [
                "사진": "스프라이트",
                "가격": 1500
            ],
            "코카콜라 제로": [
                "사진": "코카콜라 제로",
                "가격": 2000
            ],
            "코카콜라": [
                "사진": "코카콜라",
                "가격": 2000
            ]
        ]
    ]
}
